app/controllers/candidates_controller.rb

SELECT "candidates".* FROM "candidates"
---
  def index
    @candidates = Candidate.all

SELECT  "candidates".* FROM "candidates" WHERE "candidates"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @candidate = Candidate.find(params[:id])

SELECT  "candidates".* FROM "candidates" WHERE "candidates"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @candidate = Candidate.find(params[:id])

INSERT INTO "candidates" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Foo"], ["created_at", "2017-05-11 21:20:47.385358"], ["updated_at", "2017-05-11 21:20:47.385358"]]
---
  def create
    @candidate = Candidate.new(candidate_params)
    if @candidate.save

SELECT  "candidates".* FROM "candidates" WHERE "candidates"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "candidates" SET "name" = ?, "votes" = ?, "updated_at" = ? WHERE "candidates"."id" = ?  [["name", "Bar"], ["votes", 128], ["updated_at", "2017-05-11 21:23:13.945362"], ["id", 1]]
---
  def update
    @candidate = Candidate.find(params[:id])
    if @candidate.update(candidate_params)

SELECT  "candidates".* FROM "candidates" WHERE "candidates"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "candidates" WHERE "candidates"."id" = ?  [["id", 1]]
---
  def destroy
    @candidate = Candidate.find(params[:id])
    @candidate.destroy